### Pandas = PANel DAta 
***
* It is built on top of numpy
* It has a named index (accessing info by column name)->series data structure
*

In [3]:
import pandas as pd
import numpy as np

In [5]:
myarr = np.array([1,2,3])

In [7]:
mylabels = ['a', 'b', 'c']

In [8]:
pd.Series(data=myarr, index=mylabels)
# pandas series is an array with a named index

a    1
b    2
c    3
dtype: int64

In [18]:
matrix = np.random.rand(5,5)

In [19]:
matrix.shape

(5, 5)

In [25]:
my_df = pd.DataFrame(data=matrix, index='a b c d e'.split(), columns='w x y z q'.split())

In [26]:
my_df

          w         x         y         z         q
a  0.857420  0.556505  0.692477  0.389682  0.237783
b  0.504086  0.857088  0.655901  0.710539  0.980322
c  0.927958  0.871793  0.059728  0.406070  0.545860
d  0.391103  0.590429  0.512671  0.665262  0.228145
e  0.127187  0.274680  0.134723  0.709451  0.901965

In [28]:
# indexing pandas dataframe
# for accessing columns
my_df['w']

a    0.857420
b    0.504086
c    0.927958
d    0.391103
e    0.127187
Name: w, dtype: float64

In [31]:
# accessing multiple columns
my_df[['w','y']]

          w         y
a  0.857420  0.692477
b  0.504086  0.655901
c  0.927958  0.059728
d  0.391103  0.512671
e  0.127187  0.134723

In [33]:
# for accessing rows
# by name: loc
# by index: iloc
# treat it as numpy arrays indexing
my_df.loc['a']

w    0.857420
x    0.556505
y    0.692477
z    0.389682
q    0.237783
Name: a, dtype: float64

In [34]:
my_df.iloc[0]

w    0.857420
x    0.556505
y    0.692477
z    0.389682
q    0.237783
Name: a, dtype: float64

In [36]:
# conditional selection
my_df[my_df > 0.5]

          w         x         y         z         q
a  0.857420  0.556505  0.692477       NaN       NaN
b  0.504086  0.857088  0.655901  0.710539  0.980322
c  0.927958  0.871793       NaN       NaN  0.545860
d       NaN  0.590429  0.512671  0.665262       NaN
e       NaN       NaN       NaN  0.709451  0.901965

In [41]:
# having multiple conditions
my_df[(my_df['w'] > 0) & (my_df['y'] <0.5)]

          w         x         y         z         q
c  0.927958  0.871793  0.059728  0.406070  0.545860
e  0.127187  0.274680  0.134723  0.709451  0.901965

In [45]:
# group by operations
my_df.groupby('w').mean().transpose()

w  0.127187  0.391103  0.504086  0.857420  0.927958
x  0.274680  0.590429  0.857088  0.556505  0.871793
y  0.134723  0.512671  0.655901  0.692477  0.059728
z  0.709451  0.665262  0.710539  0.389682  0.406070
q  0.901965  0.228145  0.980322  0.237783  0.545860

In [47]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [48]:
# get unique values of a column
df['col2'].unique()

array([444, 555, 666])

In [51]:
# get the number of times each value occurs in a column
df['col2'].nunique()

3

In [53]:
# sort of like count, group by statement
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [55]:
# apply a function to all elements of a dataframe
def pow2(num):
    return num ** 2

In [59]:
df['col2_sq'] = df['col1'].apply(pow2)

In [61]:
df

   col1  col2 col3  col2_sq
0     1   444  abc        1
1     2   555  def        4
2     3   666  ghi        9
3     4   444  xyz       16

In [64]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
col1       4 non-null int64
col2       4 non-null int64
col3       4 non-null object
col2_sq    4 non-null int64
dtypes: int64(3), object(1)
memory usage: 208.0+ bytes

In [66]:
df.describe()

           col1        col2    col2_sq
count  4.000000    4.000000   4.000000
mean   2.500000  527.250000   7.500000
std    1.290994  106.274409   6.557439
min    1.000000  444.000000   1.000000
25%    1.750000  444.000000   3.250000
50%    2.500000  499.500000   6.500000
75%    3.250000  582.750000  10.750000
max    4.000000  666.000000  16.000000

In [69]:
# sorting values by a column
# by default ascending is true
df.sort_values(by='col2')

   col1  col2 col3  col2_sq
0     1   444  abc        1
3     4   444  xyz       16
1     2   555  def        4
2     3   666  ghi        9

In [ ]:
# pandas can read and write to multiple types of data
# for more info check out pandasIO